# -*- coding: utf-8 -*-

from random import random, randrange

#v0: نام مستعار
fh = open('name-stk.dat')
name = fh.readlines()
fh.close()

v0 = []
for i in range(len(name)):
	v0.append(str(name[i][:-1]))

#v1: سن
v1 = [
'زیر 18 سال',
'18-25',
'25-35',
'35-45',
'بالای 45'
]

#v2: جنسیت
v2 = [
'مرد',
'زن'
]
v2i = randrange(0, len(v2))

#v3: سطح تحصیلات
v3 = [
'زیر سیکل',
'دیپلم',
'لیسانس',
'فوق لیسانس',
'دکتری'
]
v3i = randrange(0, len(v3))

#v4: شغل
v4 = [
'دانشجو',
'سرباز',
'شاغل تمام وقت',
'شاغل پاره وقت',
'خانه دار',
'بیکار',
'کارمند',
'شغل آزاد',
'راننده',
'معلم یا استاد',
'موارد دیگر'
]
v4i = randrange(0, len(v4))

#v5: تعداد اعضای خانوار
v5 = range(1, 11)
v5i = randrange(0, len(v5))

#v6: میانگین درآمد ماهیانه کل خانواده
v6 = [
'کمتر از 1.5 ملیون تومان',
'بین 1.5 تا 3 ملیون تومان',
'بین 3 تا 6ملیون تومان',
'بین 6 تا 15 ملیون تومان',
'بالاتر از 15 ملیون تومان'
]
v6i = randrange(0, len(v6))

#v7: آیا گواهی نامه رانندگی دارید
v7 = [
'بله',
'خیر'
]
v7i = randrange(0, len(v7))

#v8: آیا خودروی شخصی دارید
v8 = [
'بله',
'خیر'
]
v8i = randrange(0, len(v8))

#v9: آیا قصد خرید خودرو در یک سال آینده را دارید
v9 = [
'بله',
'خیر'
]
v9i = randrange(0, len(v9))

#v10: اگر خودروی شخصی ندارید و قصد خرید در یک سال آینده نیز ندارید، دلیلش چیست
v10 = [
'قیمت بالای خرید خودرو',
'نیاز ندارم و از وسایل نقلیه عمومی استفاده می کنم',
'نیاز ندارم و پیاده روی و دوچرخه سواری می کنم',
'برای جای پارک خودرو مشکل دارم',
'استرس رانندگی و ترس از تصادف',
'از خودروی خانوادگی استفاده می کنم',
'خودروی شخصی آلودگی محیطزیست را افزایش می دهد',
'موارد دیگر'
]
v10i = randrange(0, len(v10))

#v11: مزایای داشتن خودروی شخصی
v11 = [
'راحتی رفت و آمد',
'افزایش لذت از سفر',
'بالا بردن وجه اجتماعی',
'در دسترس بودن و صرفه جویی درزمان'
]
v11i = randrange(0, len(v11))

#v12: مشکلات داشتن خودروی شخصی
v12 = [
'کم بودن جای پارک خودرو',
'هزینه های ثابت نگهداری و بیمه',
'حوادث',
'بیشتر آلوده شدن هوا و محیط زیست',
]
v12i = randrange(0, len(v12))

#v13: برای رفت و آمد و انجام امور روزانه از کدام روش ها غالبا استفاده می کنید
v13 = [
'تاکسی',
'وسایل نقلیه عمومی',
'پیاده روی',
'خودروی شخصی',
'دوچرخه',
'موتور',
'سایر موارد'
]
v13i = randrange(0, len(v13))

#v14: چه مقدار معمولا سوار خودروی شخصی می شوید
v14 = [
'سوار نمی شوم یا به ندرت استفاده می کنم',
'یکبار یا دوبار در هفته',
'سه تا چهار بار در هفته',
'اکثر روزها'
]
v14i = randrange(0, len(v14))

#v15: چه مقدار معمولا سوار تاکسی می شوید
v15 = [
'سوار نمی شوم',
'به ندرت',
'یکبار یا دوبار در هفته',
'سه تا چهار بار در هفته',
'اکثر روزها'
]
v15i = randrange(0, len(v15))

#v16: چه مقدار معمولا از وسایل نقلیه عمومی برای انجام امور روزانه استفاده می‌کنید
v16 = [
'سوار نمی شوم',
'به ندرت',
'یکبار یا دوبار در هفته',
'سه تا چهار بار در هفته',
'اکثر روزها'
]
v16i = randrange(0, len(v16))

#v17: چه مقدار معمولا از دوچرخه برای انجام امور روزانه استفاده می کنید
v17 = [
'استفاده نمی کنم',
'به ندرت',
'یکبار یا دوبار در هفته',
'سه تا چهار بار در هفته',
'اکثر روزها'
]
v17i = randrange(0, len(v17))

#v18: روزانه به طور متوسط چند کیلومتر سوار خودرو شخصی یا وسایل نقلیه عمومی می‌شوید
v18 = [
'کمتر از 10',
'بین 10 تا 20',
'بین 20 تا 30',
'بین 30 تا 40',
'بین 40 تا 50',
'بیشتر از 50'
]
v18i = randrange(0, len(v18))

#v19: در چه ناحیه ای از شهر زندگی می کنید و غالبا رفت و آمد دارید
v19 = [
'ناحیه با ترافیک زیاد',
'ناحیه با ترافیک معمولی',
'ناحیه خلوت'
]
v19i = randrange(0, len(v19))

#v20: روزانه ،به طور میانگین چه مقدار از زمان شما صرف رفت و آمد به مقصدتان می شود
v20 = [
'15 دقیقه و کمتر',
'15 الی 30 دقیقه',
'30 الی 45 دقیقه',
'45 دقیقه تا 1 ساعت',
'بیشتر از 1 ساعت'
]
v20i = randrange(0, len(v20))

#v21: بیشتر رفت و آمدهای شما در چه زمانی انجام می گیرد
v21 = [
'صبح ها 6:30 الی 8:30',
'ظهر',
'عصر',
'شب'
]
v21i = randrange(0, len(v21))

#v22: ترجیح می‌دهید تا مقصد مورد نظرتان خودتان رانندگی کنید
v22 = [
'بله',
'خیر'
]
v22i = randrange(0, len(v22))

#v23: با روش اشتراک گذاری خودرو چه مقدار آشنایی داشتید
v23 = [
'اصلا آشنایی نداشتم',
'تا حدودی آشنایی داشتم',
'کاملا آشنایی داشتم'
]
v23i = randrange(0, len(v23))

#v24: بعد از خواندن توضیحات، ‌چه مقدار علاقه‌مند به استفاده از این روش هستید
v24 = [
'ندارم',
'کم',
'متوسط',
'زیاد',
'خیلی زیاد'
]
v24i = randrange(0, len(v24))

#v25:چه مقدار مسایل محیط‌زیستی برای شما اهمیت دارد
v25 = [
'ندارد',
'کم',
'متوسط',
'زیاد',
'خیلی زیاد'
]
v25i = randrange(0, len(v25))

#v26: بیشترین هزینه‌ای که برای کرایه ساعتی حاضر به پرداخت هستید، چقدر است
v26 = [
'زیر 5 هزار تومان',
'5 تا 10 هزار تومان',
'10 تا 15 هزار تومان',
'15 تا 20 هزار تومان',
'20 تا 30 هزار تومان',
'30 تا 40 هزار تومان',
'بالای 40 هزارتومان'
]
v26i = randrange(0, len(v26))

#v27: بیشترین هزینه‌ای که برای کرایه، حاضر به پرداخت هستید، چقدر است
v27 = [
'زیر 5 هزار تومان',
'5 تا 10 هزار تومان',
'10 تا 15 هزار تومان',
'15 تا 20 هزار تومان',
'20 تا 30 هزار تومان',
'30 تا 40 هزار تومان',
'بالای 40 هزارتومان'
]
v27i = randrange(0, len(v27))

#v28: حداکثر مسافتی که برای رسیدن به خودرو حاضر هستید پیاده روی کنید چقدر است
v28 = [
'کمتر از 200 متر',
'حدود 500 متر',
'حدود 1 کیلومتر',
'حدود 1.5 کیلومتر',
'بیشتر از 2 کیلومتر'
]
v28i = randrange(0, len(v28))

#v29: اگر در مقصدتان جای پارک خودرو نباشد یا به سختی پیدا شود، چه مقدار تمایل به استفاده از خودروی شخصی برای رفتن به آن مقصد دارید
v29 = [
'زیاد',
'متوسط',
'کم'
]
v29i = randrange(0, len(v29))

#v30: اگر کارشرینگ اجرایی شود، احتمالا چه مقدار از این سیستم استفاده خواهید کرد
v30 = [
'استفاده نمی کنم',
'ماهی چندبار',
'هفته ای چندبار',
'هر روز'
]
v30i = randrange(0, len(v30))

#v31: اگر کارشرینگ اجرایی شود، برای انجام چه اموری تمایل به استفاده ازاین روش دارید
v31 = [
'سفرهای تفریحی بالای 40 کیلومتر',
'گردش درون شهری زیر 20 کیلومتر',
'انجام کارهای روزانه مانند خرید',
'رفتن به محل کار یا تحصیل',
'رفتن به مجالس و مهمانی ها',
'سایر موارد'
]
v31i = randrange(0, len(v31))

#v32: فرض کنید سیستم اشتراک گذاری خودرو به درستی اجرایی شود، آیا ممکن است از خرید خودروی جدید منصرف شوید یا خودروی شخصی خود را بفروشید
v32 = [
'بله',
'خیر'
]
v32i = randrange(0, len(v32))

#v33: بیشترین نگرانی های شما در استفاده از خودروی اشتراکی چیست
v33 = [
'بالا بودن هزینه کرایه',
'تحویل گرفتن خودرو مشکل‌دار و مقصر دانستن شما',
'تصادف',
'دور بودن خودروهای در دسترس',
'مسائل بهداشتی',
'هزینه اولیه برای ضمانت ثبت نام در این سیستم'
]
v33i = randrange(0, len(v33))

#vv: اگر توضیح یا نظر خاصی درباره سوالات و این پژوهش دارید می توانید در این قسمت بگذارید

fh = open('data.csv', 'a')

fh.write('name' + ',')
fh.write('q1' + ',')
fh.write('q2' + ',')
fh.write('q3' + ',')
fh.write('q4' + ',')
fh.write('q5' + ',')
fh.write('q6' + ',')
fh.write('q7' + ',')
fh.write('q8' + ',')
fh.write('q9' + ',')
fh.write('q10' + ',')
fh.write('q11' + ',')
fh.write('q12' + ',')
fh.write('q13' + ',')
fh.write('q14' + ',')
fh.write('q15' + ',')
fh.write('q16' + ',')
fh.write('q17' + ',')
fh.write('q18' + ',')
fh.write('q19' + ',')
fh.write('q20' + ',')
fh.write('q21' + ',')
fh.write('q22' + ',')
fh.write('q23' + ',')
fh.write('q24' + ',')
fh.write('q25' + ',')
fh.write('q26' + ',')
fh.write('q27' + ',')
fh.write('q28' + ',')
fh.write('q29' + ',')
fh.write('q30' + ',')
fh.write('q31' + ',')
fh.write('q32' + ',')
fh.write('q33' + ',')
fh.write('text' + ',')
fh.write('\n')

for i in range(300):
	v0i = randrange(0, len(v0))
	v1i = randrange(0, len(v1))
	v2i = randrange(0, len(v2))
	v3i = randrange(0, len(v3))
	v4i = randrange(0, len(v4))
	v5i = randrange(0, len(v5))
	v6i = randrange(0, len(v6))
	v7i = randrange(0, len(v7))
	v8i = randrange(0, len(v8))
	v9i = randrange(0, len(v9))
	v10i = randrange(0, len(v10))
	v11i = randrange(0, len(v11))
	v12i = randrange(0, len(v12))
	v13i = randrange(0, len(v13))
	v14i = randrange(0, len(v14))
	v15i = randrange(0, len(v15))
	v16i = randrange(0, len(v16))
	v17i = randrange(0, len(v17))
	v18i = randrange(0, len(v18))
	v19i = randrange(0, len(v19))
	v20i = randrange(0, len(v20))
	v21i = randrange(0, len(v21))
	v22i = randrange(0, len(v22))
	v23i = randrange(0, len(v23))
	v24i = randrange(0, len(v24))
	v25i = randrange(0, len(v25))
	v26i = randrange(0, len(v26))
	v27i = randrange(0, len(v27))
	v28i = randrange(0, len(v28))
	v29i = randrange(0, len(v29))
	v30i = randrange(0, len(v30))
	v31i = randrange(0, len(v31))
	v32i = randrange(0, len(v32))
	v33i = randrange(0, len(v33))

	v = [
	v0[v0i],
	v1[v1i],
	v2[v2i],
	v3[v3i],
	v4[v4i],
	v5[v5i],
	v6[v6i],
	v7[v7i],
	v8[v8i],
	v9[v9i],
	v10[v10i],
	v11[v11i],
	v12[v12i],
	v13[v13i],
	v14[v14i],
	v15[v15i],
	v16[v16i],
	v17[v17i],
	v18[v18i],
	v19[v19i],
	v20[v20i],
	v21[v21i],
	v22[v22i],
	v23[v23i],
	v24[v24i],
	v25[v25i],
	v26[v26i],
	v27[v27i],
	v28[v28i],
	v29[v29i],
	v30[v30i],
	v31[v31i],
	v32[v32i],
	v33[v33i]
	]

	for j in range(len(v)):
		fh.write(str(v[j]) + ',')

	fh.write('\n')

fh.close()
